luckyCharm1123/STM32_LED/Core/Src/main.c
    // 重置接收状态，为下一次接收做准备
    rx_index = 0;              // 重置索引
    rx_complete = 0;           // 清除完成标志
    memset(rx_buffer, 0, RX_BUFFER_SIZE);  // 清空接收缓冲区
    
    // 重新启动串口接收中断，准备接收下一个命令
    HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point. 应用程序入口点
  * @details 这是C程序的主函数，程序从这里开始执行
  *          执行流程：
  *          1. 硬件初始化（HAL库初始化）
  *          2. 系统时钟配置
  *          3. 外设初始化（GPIO、USART2）
  *          4. 发送启动信息
  *          5. 进入主循环，处理串口数据和LED闪烁
  * @retval int 返回值
  *         - 0: 程序正常退出（理论上不会执行到这里）
  *         - 其他值: 错误代码
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* 用户代码开始：第1区 */
  /* 可以在此处添加主函数开始前的预处理代码 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  /* MCU配置 */

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  /* 复位所有外设，初始化Flash接口和Systick定时器
   * HAL_Init()函数执行以下操作：
   * - 复位所有外设寄存器到默认值
   * - 初始化Flash接口（设置等待周期等）
   * - 配置SysTick定时器（1ms中断）
   * - 设置NVIC优先级分组
   */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* 用户代码开始：初始化 */
  /* 可以在此处添加自定义的初始化代码 */
  /* USER CODE END Init */

  /* Configure the system clock */
  /* 配置系统时钟 */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* 用户代码开始：系统初始化 */
  /* 可以在此处添加系统级初始化代码 */
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* 初始化所有配置的外设 */
  MX_GPIO_Init();              // 初始化GPIO（LED引脚）
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（串口）
  
  /* 用户代码开始：第2区 */
  /* 设置为ESP模式，避免触发用户命令处理逻辑 */
  esp_mode = 1;
  
  /* 发送调试信息到USART1（调试串口） */
  DEBUG_SendString("\r\n=== STM32F103 Debug Port (USART1) ===\r\n");
  DEBUG_SendString("Port: PA9(TX) / PA10(RX)\r\n");
  DEBUG_SendString("Baud: 115200 8N1\r\n");
  DEBUG_SendString("System starting...\r\n\r\n");
  
  /* 启动串口接收中断，用于接收ESP模块的响应 */
  HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
  
  /* 检查ESP WiFi自动连接状态 */
  if(ESP_CheckAutoConnect() == ESP_OK)
  {
    /* WiFi已连接，获取IP地址 */
    ESP_Status_t* status = ESP_GetStatus();
    if(strlen(status->ip_address) > 0)
    {
      USART2_SendString("WiFi connected. IP: ");
      USART2_SendString(status->ip_address);
      USART2_SendString("\r\n");
    }
    else
    {
      /* 自动连接成功但没有IP地址，手动查询 */
      USART2_SendString("WiFi connected but no IP found, querying...\r\n");
      if(ESP_QueryIP() == ESP_OK)
      {
        ESP_Status_t* status = ESP_GetStatus();
        USART2_SendString("WiFi connected. IP: ");
        USART2_SendString(status->ip_address);
        USART2_SendString("\r\n");
      }
      else
      {
        USART2_SendString("Could not retrieve IP address\r\n");
      }
    }
  }
  else
  {
    /* WiFi未连接，尝试自动连接 */
    if(ESP_ConnectWiFi(WIFI_SSID, WIFI_PASSWORD) == ESP_OK)
    {
      /* WiFi连接成功，获取IP地址 */
      ESP_Status_t* status = ESP_GetStatus();
      if(strlen(status->ip_address) > 0)
      {
        USART2_SendString("WiFi connected. IP: ");
        USART2_SendString(status->ip_address);
        USART2_SendString("\r\n");
      }
      else
      {
        /* 连接成功但没有IP地址，手动查询 */
        USART2_SendString("WiFi connected but no IP found, querying...\r\n");
        if(ESP_QueryIP() == ESP_OK)
        {
          ESP_Status_t* status = ESP_GetStatus();
          USART2_SendString("WiFi connected. IP: ");
          USART2_SendString(status->ip_address);
          USART2_SendString("\r\n");
        }
        else
        {
          USART2_SendString("Could not retrieve IP address\r\n");
        }
      }
    }
    else
    {
      USART2_SendString("WiFi connection failed\r\n");
    }
  }
  
  /* 切换回用户命令模式 */
  esp_mode = 0;
  rx_index = 0;
  rx_complete = 0;
  HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* 无限循环 */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */
    
    /* 处理ESP接收到的数据 */
    ESP_ProcessReceivedData();
    
    /* LED闪烁逻辑 */
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);  // 翻转LED引脚电平（亮/灭切换）
    HAL_Delay(500);                              // 延时500毫秒
    
    /* USER CODE BEGIN 3 */
    /* 用户代码开始：第3区 */
    /* 可以在此处添加循环体内的自定义代码 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration 系统时钟配置
  * @details 配置STM32的系统时钟源和各总线时钟分频
  *          本配置使用内部高速时钟(HSI)作为系统时钟源
  *          HSI = 8MHz (内部RC振荡器)
  * @retval None 无返回值
  * @note 时钟树配置：
  *       HSI(8MHz) → SYSCLK(8MHz) → HCLK(8MHz)
  *       → PCLK1(8MHz) → APB1外设（包括USART2）
  *       → PCLK2(8MHz) → APB2外设
  * @note 时钟配置说明：
  *       - 不使用PLL，直接使用HSI作为系统时钟
  *       - 所有总线时钟都为8MHz
  *       - Flash等待周期为0（8MHz以下不需要等待）
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};  // 振荡器初始化结构体
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};  // 时钟初始化结构体

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  * 根据RCC_OscInitTypeDef结构体中的指定参数初始化RCC振荡器
  * 
  * 配置振荡器参数：
  * - 选择振荡器类型：内部高速时钟(HSI)
  * - 设置工作状态：开启
  * - 校准值：使用默认校准值
  * - PLL状态：不使用（关闭）
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;  // 振荡器类型：内部高速时钟(HSI)
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;                    // HSI状态：开启
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;  // HSI校准值：默认值
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;              // PLL状态：不使用（PLL关闭）
  
  /* 应用振荡器配置 */
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();  // 如果配置失败，调用错误处理函数
  }

  /** Initializes the CPU, AHB and APB buses clocks
  * 初始化CPU、AHB和APB总线时钟
  * 
  * 配置时钟树参数：
  * - 选择系统时钟源：HSI
  * - 设置各总线分频系数：都不分频
  * - 配置Flash等待周期：0（8MHz以下不需要等待）
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;  // 时钟类型：HCLK、SYSCLK、PCLK1、PCLK2
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;    // 系统时钟源：HSI
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;        // AHB时钟分频：不分频（HCLK = SYSCLK）
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;         // APB1时钟分频：不分频（PCLK1 = HCLK）
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;         // APB2时钟分频：不分频（PCLK2 = HCLK）

